Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.Product
Represents a single data product in the data product index.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.Product.Lifecycle
Indicates the lifecycle phase of the data product.
The lifecycle phases are as follows:
- "experimental": The data product is experimental. The API is unstable and changes are expected
to be incompatible. There's no guarantee of stability or any support.
- "preview": The data product is in preview. The API is mostly stable but some changes are
still expected. The data product has limited support until it reaches the production phase.
- "production": The data product is in production. The API is stable and changes are expected to be
backwards compatible. The data product is fully supported and may receive additional features and updates in the future.
- "deprecated": The data product has been deprecated. Integrations should be updated to use a different
data product. The data product has limited support and will not receive any new features or updates.
- "end-of-life": The data product has reached the end of life. The data product is no longer supported and will be removed soon.

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.Product.EndOfLife
The planned end of life date of the data product in ISO format.
Present only if the lifecycle phase is "end-of-life".

Tekla.Structures.ModelInternal.BimModelDataProduct.DTO.Product.Metadata
Additional metadata entries about the data product.